Squallsnext/waveshare-esp32s3-touch-lcd/sdkconfig.defaults
# sdkconfig.defaults - Waveshare ESP32-S3 Touch LCD configuration
# Verified working with ESP-IDF v5.3

# --- Target SoC ---
CONFIG_IDF_TARGET="esp32s3"

# --- USB CDC Serial Console ---
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_NONE=y

# --- CPU Frequency ---
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# --- PSRAM / LVGL (configure via menuconfig if needed) ---
# Run `idf.py menuconfig` to enable PSRAM and LVGL options
# - Enable PSRAM under: Component Config → ESP PSRAM
# - Enable LVGL under: Component Config → LVGL (after adding managed dependency)
